jh247247/esp32-brother-ptouch/src/ptouch_usb.c
/* SPDX-License-Identifier: Apache-2.0
 * Copyright 2026 Jack Hosemans
 *
 * ptouch_usb.c — ESP32 USB-host transport for Brother P-touch printers.
 * See ptouch_usb.h for the API and the USB-PHY caveat.
 */
#include "ptouch_usb.h"
#include "ptouch_completion.h"
#include "ptouch_print.h"
#include "ptouch_usb_descriptor.h"

#include <stdio.h>
#include <string.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "freertos/queue.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "esp_intr_alloc.h"
#include "esp_idf_version.h"
#include "esp_bit_defs.h"
#include "usb/usb_host.h"

static const char *TAG = "ptouch_usb";

static ptouch_usb_config_t s_cfg;
static usb_host_client_handle_t s_client;
static QueueHandle_t s_event_queue;
static TaskHandle_t s_event_task_handle;
static portMUX_TYPE s_start_lock = portMUX_INITIALIZER_UNLOCKED;
static portMUX_TYPE s_gate_lock = portMUX_INITIALIZER_UNLOCKED;
static bool s_start_called;

/* Persisted device context for bulk I/O. Set at enumeration, cleared on
 * disconnect. Guarded by s_io_mtx while a transaction runs so a mid-transfer
 * unplug can't free the device out from under us. */
static usb_device_handle_t s_dev;
static usb_device_handle_t s_observed_dev;
static uint8_t   s_intf_num;
static uint8_t   s_bulk_out_ep, s_bulk_in_ep;
static uint16_t  s_bulk_in_mps = 64;
static volatile bool s_intf_claimed;
static volatile bool s_device_detected;
static const ptouch_model_profile_t *s_profile;
static ptouch_usb_devinfo_t s_device_info;
static volatile uint32_t s_attachment_generation;
static volatile bool s_dev_gone_pending;
static volatile int s_new_dev_addr_pending = -1;
/* The application gate is temporary (boot recovery, queue synchronization).
 * The output quarantine is transport-owned and latches whenever bytes may
 * have reached the printer without a confirmed mechanical completion. Keeping
 * them separate lets a proven pre-output CLAIMED receipt run its idle
 * preflight without accidentally clearing a same-boot ambiguous print. */
static bool s_status_app_blocked;
static bool s_output_quarantined;
static bool s_transport_faulted;
/* A successful chain command deliberately leaves the printer non-idle.  No
 * status transaction may reset that state; only the next generation-matched
 * raster job may consume it. Guarded by s_io_mtx. */
static bool s_chain_pending;
static SemaphoreHandle_t s_io_mtx;
static SemaphoreHandle_t s_cache_mtx;
static ptouch_status_t s_status_cache;
static int64_t s_status_cache_us = -1;
static uint32_t s_status_cache_generation;

/* Caller owns the I/O lease, which pins `generation` to the status source. */
static void publish_status_cache_locked(const ptouch_status_t *status,
                                        uint32_t generation)
{
    if (!status || !status->valid || !s_cache_mtx) return;
    xSemaphoreTake(s_cache_mtx, portMAX_DELAY);
    s_status_cache = *status;
    s_status_cache_us = esp_timer_get_time();
    s_status_cache_generation = generation;
    xSemaphoreGive(s_cache_mtx);
}

typedef struct {
    ptouch_usb_event_t evt;
    bool has_info;
    ptouch_usb_devinfo_t info;
} ptouch_usb_event_message_t;

static void event_task(void *arg)
{
    (void)arg;
    ptouch_usb_event_message_t message;
    for (;;) {
        if (xQueueReceive(s_event_queue, &message, portMAX_DELAY) == pdTRUE &&
            s_cfg.on_event) {
            s_cfg.on_event(message.evt,
                           message.has_info ? &message.info : NULL,
                           s_cfg.user_ctx);
        }
    }
}

/* Queueing is safe while s_io_mtx is held because user code runs only on the
 * dedicated event task. Device information is copied before the lock is
 * released, so callbacks never observe a later attachment generation. */
static void emit(ptouch_usb_event_t evt, const ptouch_usb_devinfo_t *info)
{
    if (!s_cfg.on_event || !s_event_queue) return;
    ptouch_usb_event_message_t message = {
        .evt = evt,
        .has_info = info != NULL,
    };
    if (info) message.info = *info;
    if (xQueueSend(s_event_queue, &message, 0) != pdTRUE) {
        ESP_LOGE(TAG, "dropping USB event %d: callback queue full", (int)evt);
    }
}

static bool profile_output_allowed(const ptouch_model_profile_t *profile)
{
    return ptouch_model_output_allowed(
        profile, s_cfg.allow_experimental_profiles);
}

static bool status_commands_blocked_locked(void)
{
    taskENTER_CRITICAL(&s_gate_lock);
    bool blocked =
        s_status_app_blocked || s_output_quarantined || s_transport_faulted ||
        s_chain_pending;
    taskEXIT_CRITICAL(&s_gate_lock);
    return blocked;
}

static bool transport_faulted(void)
{
    taskENTER_CRITICAL(&s_gate_lock);
    bool faulted = s_transport_faulted;
    taskEXIT_CRITICAL(&s_gate_lock);
    return faulted;
}

static bool output_quarantined(void)
{
    taskENTER_CRITICAL(&s_gate_lock);
    bool quarantined = s_output_quarantined;
    taskEXIT_CRITICAL(&s_gate_lock);
    return quarantined;
}

static void quarantine_output(void)
{
    taskENTER_CRITICAL(&s_gate_lock);
    s_output_quarantined = true;
    taskEXIT_CRITICAL(&s_gate_lock);
}

static void fault_transport(bool quarantine)
{
    taskENTER_CRITICAL(&s_gate_lock);
    s_transport_faulted = true;
    if (quarantine) s_output_quarantined = true;
    taskEXIT_CRITICAL(&s_gate_lock);
}

bool ptouch_usb_attached(void)
{
    if (!s_io_mtx) return false;
    xSemaphoreTake(s_io_mtx, portMAX_DELAY);
    bool attached = !s_dev_gone_pending && s_intf_claimed &&
                    profile_output_allowed(s_profile);
    xSemaphoreGive(s_io_mtx);
    return attached;
}

bool ptouch_usb_device_info(ptouch_usb_devinfo_t *out)
{
    if (!out || !s_io_mtx) return false;
    xSemaphoreTake(s_io_mtx, portMAX_DELAY);
    bool present = s_device_detected && !s_dev_gone_pending;
    if (present) *out = s_device_info;
    xSemaphoreGive(s_io_mtx);
    return present;
}

bool ptouch_usb_target_snapshot(ptouch_usb_target_t *out)
{
    if (!out || !s_io_mtx) return false;
    xSemaphoreTake(s_io_mtx, portMAX_DELAY);
    bool ready = !s_dev_gone_pending && s_intf_claimed && s_dev &&
                 profile_output_allowed(s_profile);
    if (ready) {
        out->profile = s_profile;
        out->vid = s_device_info.vid;
        out->pid = s_device_info.pid;
        out->generation = s_attachment_generation;
    }
    xSemaphoreGive(s_io_mtx);
    return ready;
}

void ptouch_usb_set_status_commands_blocked(bool blocked)
{
    taskENTER_CRITICAL(&s_gate_lock);
    s_status_app_blocked = blocked;
    taskEXIT_CRITICAL(&s_gate_lock);
}

bool ptouch_usb_status_commands_blocked(void)
{
    return status_commands_blocked_locked();
}

void ptouch_usb_clear_output_quarantine_after_inspection(void)
{
    taskENTER_CRITICAL(&s_gate_lock);
    s_output_quarantined = false;
    taskEXIT_CRITICAL(&s_gate_lock);
}

bool ptouch_usb_output_quarantined(void)
{
    return output_quarantined();
}

bool ptouch_usb_transport_faulted(void)
{
    return transport_faulted();
}

