jh247247/esp32-brother-ptouch/src/ptouch_usb.c
/* ------------------------------------------------------- enumeration ------ */
/* Called only by usb_task after it has acquired s_io_mtx. */
static void report_device_locked(uint8_t addr)
{
    usb_device_handle_t dev;
    esp_err_t err = usb_host_device_open(s_client, addr, &dev);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "device_open(%d) failed: %s", addr, esp_err_to_name(err));
        return;
    }

    /* One physical target at a time. A hub or second device must not overwrite
     * the identity/generation of the active printer. */
    if (s_observed_dev) {
        ESP_LOGW(TAG, "ignoring additional USB device at address %u while a target is active",
                 addr);
        usb_host_device_close(s_client, dev);
        return;
    }
    s_observed_dev = dev;

    const char *speed_str = "?";
    usb_device_info_t info;
    if (usb_host_device_info(dev, &info) == ESP_OK) {
        speed_str = (info.speed <= USB_SPEED_HIGH)
                    ? (const char *[]){"Low", "Full", "High"}[info.speed] : "?";
    }

    const usb_device_desc_t *dd = NULL;
    uint16_t vid = 0, pid = 0;
    if (usb_host_get_device_descriptor(dev, &dd) == ESP_OK && dd) {
        vid = dd->idVendor; pid = dd->idProduct;
        if (s_cfg.dump_descriptors) usb_print_device_descriptor(dd);
    }

    const ptouch_model_profile_t *profile = ptouch_model_lookup(vid, pid);
    ptouch_support_t support = profile ? profile->support : PTOUCH_SUPPORT_UNKNOWN;
    ++s_attachment_generation;
    s_device_detected = true;
    s_profile = profile;
    s_device_info = (ptouch_usb_devinfo_t) {
        .vid = vid,
        .pid = pid,
        .speed = speed_str,
        .profile = profile,
        .support = support,
        .claimed = false,
        .generation = s_attachment_generation,
    };
    if (s_cache_mtx) {
        xSemaphoreTake(s_cache_mtx, portMAX_DELAY);
        s_status_cache_us = -1;
        s_status_cache_generation = 0;
        xSemaphoreGive(s_cache_mtx);
    }

    if (!profile_output_allowed(profile)) {
        ESP_LOGW(TAG, "refusing USB device VID:0x%04X PID:0x%04X model=%s support=%s",
                 vid, pid, profile ? profile->name : "unknown",
                 ptouch_support_name(support));
        emit(PTOUCH_USB_EVT_UNSUPPORTED, &s_device_info);
        return;
    }

    ptouch_usb_bulk_pair_t pair = {0};
    bool pair_valid = false;
    const usb_config_desc_t *cfg = NULL;
    if (usb_host_get_active_config_descriptor(dev, &cfg) == ESP_OK && cfg) {
        if (s_cfg.dump_descriptors) usb_print_config_descriptor(cfg, NULL);
        pair_valid = ptouch_usb_find_printer_bulk_pair(
            (const uint8_t *)cfg, cfg->wTotalLength, &pair);
    }

    ESP_LOGI(TAG, "device VID:0x%04X PID:0x%04X model=%s speed=%s bulkOUT=0x%02X bulkIN=0x%02X",
             vid, pid, profile->name, speed_str,
             pair_valid ? pair.bulk_out_ep : 0,
             pair_valid ? pair.bulk_in_ep : 0);

    if (pair_valid) {
        s_dev         = dev;
        s_intf_num    = pair.interface_number;
        s_bulk_out_ep = pair.bulk_out_ep;
        s_bulk_in_ep  = pair.bulk_in_ep;
        s_bulk_in_mps = pair.bulk_in_mps;
        esp_err_t ce = usb_host_interface_claim(
            s_client, dev, s_intf_num, pair.alternate_setting);
        s_intf_claimed = (ce == ESP_OK);
        if (s_intf_claimed) {
            ESP_LOGI(TAG, "claimed interface %u (bulkOUT 0x%02x, bulkIN 0x%02x mps=%u)",
                     s_intf_num, s_bulk_out_ep, s_bulk_in_ep, s_bulk_in_mps);
            s_device_info.bulk_out_ep = s_bulk_out_ep;
            s_device_info.bulk_in_ep = s_bulk_in_ep;
            s_device_info.claimed = true;
            emit(PTOUCH_USB_EVT_ATTACHED, &s_device_info);
        } else {
            ESP_LOGE(TAG, "interface_claim(%u) failed: %s", s_intf_num, esp_err_to_name(ce));
            s_dev = NULL;
            emit(PTOUCH_USB_EVT_ATTACH_FAILED, &s_device_info);
        }
    } else {
        ESP_LOGW(TAG, "supported model has no same-interface bulk IN/OUT pair");
        emit(PTOUCH_USB_EVT_ATTACH_FAILED, &s_device_info);
    }
}

/* -------------------------------------------------------- bulk I/O -------- */
/* A transfer's callback runs in the USB client task; it just wakes the caller. */
static void xfer_cb(usb_transfer_t *t)
{
    xSemaphoreGive((SemaphoreHandle_t)t->context);
}

typedef enum {
    XFER_OK = 0,
    XFER_TIMEOUT,
    XFER_ERROR,
} xfer_result_t;

#define PTOUCH_TRANSFER_RECLAIM_GRACE_MS 1000

/* ESP-IDF requires an endpoint to be halted before it can be flushed. A
 * transfer must also remain allocated until its cancellation callback runs.
 * Waiting for that callback here avoids freeing an in-flight transfer and
 * leaving the endpoint in ESP_ERR_INVALID_STATE after a timeout. */
static xfer_result_t cancel_timed_out_transfer(usb_transfer_t *t,
                                               SemaphoreHandle_t sem,
                                               bool quarantine_transport,
                                               bool *retain_resources)
{
    if (retain_resources) *retain_resources = false;
    if (quarantine_transport) {
        ESP_LOGE(TAG,
                 "retaining timed-out print transfer until callback resolves ownership");
    }
    esp_err_t halt = usb_host_endpoint_halt(s_dev, t->bEndpointAddress);
    if (halt != ESP_OK && halt != ESP_ERR_INVALID_STATE) {
        ESP_LOGE(TAG, "halt ep 0x%02x after timeout: %s",
                 t->bEndpointAddress, esp_err_to_name(halt));
    }

    esp_err_t flush = usb_host_endpoint_flush(s_dev, t->bEndpointAddress);
    if (flush != ESP_OK && flush != ESP_ERR_INVALID_STATE) {
        ESP_LOGE(TAG, "flush ep 0x%02x after timeout: %s",
                 t->bEndpointAddress, esp_err_to_name(flush));
    }

    /* A successful flush cancels queued transfers and delivers their callback
     * through usb_host_client_handle_events(). If halt/flush raced a just-
     * completed transfer, that normal callback is delivered instead. In both
     * cases ownership does not return to the caller until the transfer is no
     * longer in flight. */
    if (xSemaphoreTake(sem, pdMS_TO_TICKS(PTOUCH_TRANSFER_RECLAIM_GRACE_MS)) !=
        pdTRUE) {
        /* ESP-IDF forbids freeing an in-flight transfer. Retain this one
         * transfer and its semaphore for the rest of the boot, then fault the
         * transport so no second leak or unsafe command can occur. */
        if (retain_resources) *retain_resources = true;
        fault_transport(quarantine_transport);
        ESP_LOGE(TAG,
                 "transfer callback did not arrive within %d ms; transport faulted until reboot",
                 PTOUCH_TRANSFER_RECLAIM_GRACE_MS);
        return XFER_TIMEOUT;
    }

