jh247247/esp32-brother-ptouch/src/ptouch_usb.c
    if (halt == ESP_OK || flush == ESP_OK) {
        esp_err_t clear = usb_host_endpoint_clear(s_dev, t->bEndpointAddress);
        if (clear != ESP_OK && clear != ESP_ERR_INVALID_STATE) {
            ESP_LOGE(TAG, "clear ep 0x%02x after timeout: %s",
                     t->bEndpointAddress, esp_err_to_name(clear));
        }
    }

    if (t->status == USB_TRANSFER_STATUS_COMPLETED) return XFER_OK;
    if (quarantine_transport) {
        quarantine_output();
        ESP_LOGE(TAG, "timed-out print transfer did not complete; transport quarantined");
    }
    return XFER_TIMEOUT;
}

static xfer_result_t submit_and_wait(usb_transfer_t *t, SemaphoreHandle_t sem,
                                     int timeout_ms, bool *submitted,
                                     bool quarantine_on_timeout,
                                     bool *retain_resources)
{
    if (submitted) *submitted = false;
    if (retain_resources) *retain_resources = false;
    t->callback = xfer_cb;
    t->context = sem;
    t->device_handle = s_dev;
    esp_err_t e = usb_host_transfer_submit(t);
    if (e != ESP_OK) {
        ESP_LOGE(TAG, "submit ep 0x%02x: %s", t->bEndpointAddress, esp_err_to_name(e));
        return XFER_ERROR;
    }
    if (submitted) *submitted = true;
    if (xSemaphoreTake(sem, pdMS_TO_TICKS(timeout_ms)) != pdTRUE) {
        ESP_LOGW(TAG, "ep 0x%02x timeout — halting and canceling",
                 t->bEndpointAddress);
        return cancel_timed_out_transfer(t, sem, quarantine_on_timeout,
                                         retain_resources);
    }
    if (t->status != USB_TRANSFER_STATUS_COMPLETED) {
        ESP_LOGW(TAG, "ep 0x%02x transfer status=%d", t->bEndpointAddress, t->status);
        return XFER_ERROR;
    }
    return XFER_OK;
}

static ptouch_usb_transfer_result_t bulk_out_locked(
    const uint8_t *data, size_t len, int timeout_ms, bool *stream_submitted)
{
    SemaphoreHandle_t sem = NULL;
    usb_transfer_t *t = NULL;
    size_t chunk = 0;
    bool retain_resources = false;
    ptouch_usb_transfer_result_t rc;

    if (stream_submitted) *stream_submitted = false;

    if (!data || len == 0 || timeout_ms <= 0) {
        rc = PTOUCH_USB_TRANSFER_INVALID_ARGUMENT;
        goto cleanup;
    }
    if (transport_faulted()) {
        rc = PTOUCH_USB_TRANSFER_TRANSPORT_FAULT;
        goto cleanup;
    }
    if (output_quarantined()) {
        rc = PTOUCH_USB_TRANSFER_BLOCKED;
        goto cleanup;
    }
    if (!s_intf_claimed || !s_dev) {
        rc = PTOUCH_USB_TRANSFER_NOT_ATTACHED;
        goto cleanup;
    }

    sem = xSemaphoreCreateBinary();
    chunk = (len && len < 4096) ? len : 4096;
    if (!sem || usb_host_transfer_alloc(chunk, 0, &t) != ESP_OK) {
        rc = PTOUCH_USB_TRANSFER_ALLOCATION_FAILED;
        goto cleanup;
    }

    rc = PTOUCH_USB_TRANSFER_OK;
    for (size_t off = 0; off < len; ) {
        size_t n = len - off;
        if (n > chunk) n = chunk;
        memcpy(t->data_buffer, data + off, n);
        t->num_bytes = (int)n;
        t->bEndpointAddress = s_bulk_out_ep;
        bool submitted = false;
        if (submit_and_wait(t, sem, timeout_ms, &submitted, true,
                            &retain_resources) != XFER_OK) {
            if (submitted && stream_submitted) *stream_submitted = true;
            rc = PTOUCH_USB_TRANSFER_IO_ERROR;
            break;
        }
        if (stream_submitted) *stream_submitted = true;
        off += n;
    }

cleanup:
    if (!retain_resources) {
        if (t) usb_host_transfer_free(t);
        if (sem) vSemaphoreDelete(sem);
    }
    return rc;
}

int ptouch_usb_bulk_out(const uint8_t *data, size_t len, int timeout_ms)
{
    if (!s_io_mtx) return -1;
    xSemaphoreTake(s_io_mtx, portMAX_DELAY);
    int rc = bulk_out_locked(data, len, timeout_ms, NULL);
    xSemaphoreGive(s_io_mtx);
    return rc;
}

static ptouch_usb_transfer_result_t print_job_out_locked(
    const ptouch_print_job_t *job, int timeout_ms, bool *stream_submitted)
{
    if (stream_submitted) *stream_submitted = false;
    if (!ptouch_print_job_frames_valid(job)) {
        return PTOUCH_USB_TRANSFER_INVALID_ARGUMENT;
    }
    if (job->profile->transfer_policy == PTOUCH_TRANSFER_COALESCED) {
        return bulk_out_locked(job->stream.data, job->stream.len, timeout_ms,
                               stream_submitted);
    }
    /* Validate the complete frame table before the first byte can leave the
     * host. A malformed middle offset must be a zero-output rejection. */
    size_t start = 0;
    size_t max_frame = 0;
    for (size_t i = 0; i < job->frame_count; ++i) {
        size_t end = job->frame_ends[i];
        if (end <= start || end > job->stream.len) {
            return PTOUCH_USB_TRANSFER_INVALID_ARGUMENT;
        }
        size_t frame_len = end - start;
        if (frame_len > max_frame) max_frame = frame_len;
        start = end;
    }

    SemaphoreHandle_t sem = xSemaphoreCreateBinary();
    usb_transfer_t *transfer = NULL;
    bool retain_resources = false;
    if (!sem || max_frame == 0 ||
        usb_host_transfer_alloc(max_frame, 0, &transfer) != ESP_OK) {
        if (sem) vSemaphoreDelete(sem);
        return PTOUCH_USB_TRANSFER_ALLOCATION_FAILED;
    }

    ptouch_usb_transfer_result_t rc = PTOUCH_USB_TRANSFER_OK;
    bool any_submitted = false;
    start = 0;
    for (size_t i = 0; i < job->frame_count; ++i) {
        size_t end = job->frame_ends[i];
        size_t frame_len = end - start;
        memcpy(transfer->data_buffer, job->stream.data + start, frame_len);
        transfer->num_bytes = (int)frame_len;
        transfer->bEndpointAddress = s_bulk_out_ep;
        bool submitted = false;
        if (submit_and_wait(transfer, sem, timeout_ms, &submitted, true,
                            &retain_resources) !=
            XFER_OK) {
            any_submitted = any_submitted || submitted;
            rc = PTOUCH_USB_TRANSFER_IO_ERROR;
            break;
        }
        any_submitted = true;
        start = end;
    }
    if (!retain_resources) {
        usb_host_transfer_free(transfer);
        vSemaphoreDelete(sem);
    }
    if (stream_submitted) *stream_submitted = any_submitted;
    return rc;
}

static const char *status_txn_locked(ptouch_status_t *st,
                                     bool after_inspection);

static ptouch_usb_completion_result_t wait_for_print_completion_locked(
    int timeout_ms, ptouch_usb_print_result_t *result,
    ptouch_completion_tracker_t *tracker)
{
    if (!result || !tracker || timeout_ms <= 0) {
        return PTOUCH_USB_COMPLETION_IO_ERROR;
    }
    SemaphoreHandle_t sem = xSemaphoreCreateBinary();
    usb_transfer_t *rx = NULL;
    int rxlen = ((PTOUCH_STATUS_LENGTH + s_bulk_in_mps - 1) /
                 s_bulk_in_mps) * s_bulk_in_mps;
    if (!sem || usb_host_transfer_alloc(rxlen, 0, &rx) != ESP_OK) {
        if (sem) vSemaphoreDelete(sem);
        return PTOUCH_USB_COMPLETION_IO_ERROR;
    }

    const int64_t deadline = esp_timer_get_time() + (int64_t)timeout_ms * 1000;
    int invalid_frames = 0;
    bool retain_resources = false;
    ptouch_usb_completion_result_t completion = PTOUCH_USB_COMPLETION_TIMEOUT;

    while (esp_timer_get_time() < deadline) {
        int64_t remaining_us = deadline - esp_timer_get_time();
        int remaining_ms = (int)((remaining_us + 999) / 1000);
        if (remaining_ms < 1) remaining_ms = 1;

        rx->num_bytes = rxlen;
        rx->bEndpointAddress = s_bulk_in_ep;
        xfer_result_t xr = submit_and_wait(rx, sem, remaining_ms, NULL, true,
                                           &retain_resources);
        if (xr == XFER_TIMEOUT) {
            completion = PTOUCH_USB_COMPLETION_TIMEOUT;
            break;
        }
        if (xr != XFER_OK) {
            completion = PTOUCH_USB_COMPLETION_IO_ERROR;
            break;
        }
        if (rx->actual_num_bytes < PTOUCH_STATUS_LENGTH) {
            continue; /* ZLP or a short stale USB packet */
        }

        for (int off = 0;
             off + PTOUCH_STATUS_LENGTH <= rx->actual_num_bytes;
             off += PTOUCH_STATUS_LENGTH) {
            ptouch_status_t status;
            ptouch_parse_status(rx->data_buffer + off, &status);
            if (!status.valid) {
                if (++invalid_frames >= 4) {
                    completion = PTOUCH_USB_COMPLETION_PROTOCOL_ERROR;
                    goto done;
                }
                continue;
            }

            result->has_status = true;
            result->status = status;
            ESP_LOGI(TAG,
                     "print status type=0x%02x phase=0x%02x/%u mode=0x%02x errors=0x%02x/0x%02x",
                     status.status_type, status.phase_type, status.phase_number,
                     status.mode, status.error_information_1,
                     status.error_information_2);

            ptouch_completion_observation_t observation =
                ptouch_completion_observe(tracker, &status);
            if (observation == PTOUCH_COMPLETION_PRINTER_ERROR) {
                completion = PTOUCH_USB_COMPLETION_PRINTER_ERROR;
                goto done;
            }
            if (observation == PTOUCH_COMPLETION_CONFIRMED) {
                completion = PTOUCH_USB_COMPLETION_OK;
                goto done;
            }
        }
    }

done:
    if (!retain_resources) {
        usb_host_transfer_free(rx);
        vSemaphoreDelete(sem);
    }
    return completion;
}

ptouch_usb_print_result_t ptouch_usb_print_and_wait(
    const uint8_t *data, size_t len,
    int transfer_timeout_ms, int completion_timeout_ms)
{
    ptouch_usb_print_result_t result = {
        .transfer_rc = PTOUCH_USB_TRANSFER_INVALID_ARGUMENT,
        .completion_rc = PTOUCH_USB_COMPLETION_NOT_RUN,
    };
    if (!s_io_mtx) return result;

