jh247247/esp32-brother-ptouch/src/ptouch_usb.c
    xSemaphoreTake(s_io_mtx, portMAX_DELAY);
    if (transport_faulted()) {
        result.transfer_rc = PTOUCH_USB_TRANSFER_TRANSPORT_FAULT;
        xSemaphoreGive(s_io_mtx);
        return result;
    }
    if (status_commands_blocked_locked()) {
        result.transfer_rc = PTOUCH_USB_TRANSFER_BLOCKED;
        xSemaphoreGive(s_io_mtx);
        return result;
    }
    if (s_dev_gone_pending || s_profile != ptouch_model_p710bt()) {
        result.transfer_rc = s_dev_gone_pending
                                 ? PTOUCH_USB_TRANSFER_NOT_ATTACHED
                                 : PTOUCH_USB_TRANSFER_UNSUPPORTED;
        xSemaphoreGive(s_io_mtx);
        return result;
    }
    ptouch_completion_tracker_t tracker;
    ptouch_completion_tracker_init(&tracker);

    /* Establish an RX epoch before the first raster byte. The status request
     * drains every automatic frame queued by an earlier job and returns only
     * after a fresh idle reply. Holding s_io_mtx across this preflight, OUT,
     * and completion wait prevents another caller from creating ambiguity. */
    ptouch_status_t preflight;
    const char *preflight_error = status_txn_locked(&preflight, false);
    result.has_status = preflight.valid;
    if (preflight.valid) result.status = preflight;
    if (preflight_error || !ptouch_status_is_idle_ready(&preflight)) {
        result.transfer_rc = PTOUCH_USB_TRANSFER_PREFLIGHT_FAILED;
    } else {
        ptouch_completion_tracker_arm_for_strategy(
            &tracker, s_profile ? s_profile->completion_strategy
                                : PTOUCH_COMPLETION_STRICT_NOTIFICATIONS);
        result.transfer_rc = bulk_out_locked(
            data, len, transfer_timeout_ms, &result.stream_submitted);
    }
    if (result.transfer_rc == PTOUCH_USB_TRANSFER_OK) {
        result.completion_rc = wait_for_print_completion_locked(
            completion_timeout_ms, &result, &tracker);
        if (result.completion_rc == PTOUCH_USB_COMPLETION_OK &&
            !s_profile->completion_validated) {
            /* A non-completion-validated profile may produce inspected output,
             * but nominal JOB_STATUS cannot prove current-label completion. */
            result.completion_rc = PTOUCH_USB_COMPLETION_UNVALIDATED;
        }
    }
    if (result.stream_submitted &&
        (result.transfer_rc != PTOUCH_USB_TRANSFER_OK ||
         result.completion_rc != PTOUCH_USB_COMPLETION_OK)) {
        /* Latch before releasing the lease so a queued observer cannot
         * issue ESC @ into a physically ambiguous printer state. */
        quarantine_output();
    }
    xSemaphoreGive(s_io_mtx);
    return result;
}

ptouch_usb_print_result_t ptouch_usb_print_job_and_wait(
    const ptouch_print_job_t *job,
    int transfer_timeout_ms, int completion_timeout_ms)
{
    ptouch_usb_print_result_t result = {
        .transfer_rc = PTOUCH_USB_TRANSFER_INVALID_ARGUMENT,
        .completion_rc = PTOUCH_USB_COMPLETION_NOT_RUN,
    };
    bool continuing_chain = false;
    if (!s_io_mtx || !ptouch_print_job_frames_valid(job)) return result;

    xSemaphoreTake(s_io_mtx, portMAX_DELAY);
    if (transport_faulted()) {
        result.transfer_rc = PTOUCH_USB_TRANSFER_TRANSPORT_FAULT;
        goto done;
    }
    /* A pending chain blocks observers, but is the expected entry state for
     * its continuation. The other safety gates still apply. */
    continuing_chain = s_chain_pending;
    taskENTER_CRITICAL(&s_gate_lock);
    bool output_blocked = s_status_app_blocked || s_output_quarantined ||
                          s_transport_faulted;
    taskEXIT_CRITICAL(&s_gate_lock);
    if (output_blocked) {
        result.transfer_rc = PTOUCH_USB_TRANSFER_BLOCKED;
        goto done;
    }
    if (s_dev_gone_pending) {
        result.transfer_rc = PTOUCH_USB_TRANSFER_NOT_ATTACHED;
        goto done;
    }
    if (!profile_output_allowed(s_profile)) {
        result.transfer_rc = PTOUCH_USB_TRANSFER_UNSUPPORTED;
        goto done;
    }
    if (!s_intf_claimed || !s_dev) {
        result.transfer_rc = PTOUCH_USB_TRANSFER_NOT_ATTACHED;
        goto done;
    }
    if (job->profile != s_profile ||
        job->attachment_generation != s_attachment_generation) {
        result.transfer_rc = PTOUCH_USB_TRANSFER_TARGET_CHANGED;
        goto done;
    }

    ptouch_status_t preflight = {0};
    const char *preflight_error = NULL;
    if (!continuing_chain) {
        preflight_error = status_txn_locked(&preflight, false);
        result.has_status = preflight.valid;
        if (preflight.valid) result.status = preflight;
    }

    ptouch_media_geometry_t geometry;
    bool media_ok = continuing_chain || (preflight.valid &&
        preflight.media_width_mm == job->tape_mm &&
        ptouch_model_accepts_media(s_profile, preflight.media_width_mm,
                                   preflight.media_type) &&
        ptouch_media_geometry(s_profile, preflight.media_width_mm, &geometry));
    bool model_ok = continuing_chain || !s_profile->expected_status_model ||
                    preflight.model == s_profile->expected_status_model;
    if (s_dev_gone_pending) {
        result.transfer_rc = PTOUCH_USB_TRANSFER_NOT_ATTACHED;
        goto done;
    }
    if (job->profile != s_profile ||
        job->attachment_generation != s_attachment_generation) {
        result.transfer_rc = PTOUCH_USB_TRANSFER_TARGET_CHANGED;
        goto done;
    }
    if (preflight_error || (!continuing_chain && !ptouch_status_is_idle_ready(&preflight)) ||
        !media_ok || !model_ok) {
        result.transfer_rc = PTOUCH_USB_TRANSFER_PREFLIGHT_FAILED;
        goto done;
    }

    ptouch_completion_tracker_t tracker;
    ptouch_completion_tracker_init(&tracker);
    ptouch_completion_tracker_arm_for_strategy(
        &tracker, s_profile->completion_strategy);
    result.transfer_rc = print_job_out_locked(
        job, transfer_timeout_ms, &result.stream_submitted);
    if (result.transfer_rc == PTOUCH_USB_TRANSFER_OK) {
        result.completion_rc = wait_for_print_completion_locked(
            completion_timeout_ms, &result, &tracker);
        if (result.completion_rc == PTOUCH_USB_COMPLETION_OK &&
            !s_profile->completion_validated) {
            result.completion_rc = PTOUCH_USB_COMPLETION_UNVALIDATED;
        }
        if (result.completion_rc == PTOUCH_USB_COMPLETION_OK) {
            taskENTER_CRITICAL(&s_gate_lock);
            s_chain_pending = job->chain;
            taskEXIT_CRITICAL(&s_gate_lock);
        }
    }

done:
    if ((result.stream_submitted || continuing_chain) &&
        (result.transfer_rc != PTOUCH_USB_TRANSFER_OK ||
         result.completion_rc != PTOUCH_USB_COMPLETION_OK)) {
        quarantine_output();
        taskENTER_CRITICAL(&s_gate_lock);
        s_chain_pending = false;
        taskEXIT_CRITICAL(&s_gate_lock);
    }
    xSemaphoreGive(s_io_mtx);
    return result;
}

ptouch_usb_print_result_t ptouch_usb_print_bitmap(
    const uint8_t *px, int w, int h,
    const ptouch_print_opts_t *opts,
    int completion_timeout_ms)
{
    ptouch_usb_print_result_t result = {
        .transfer_rc = PTOUCH_USB_TRANSFER_INVALID_ARGUMENT,
        .completion_rc = PTOUCH_USB_COMPLETION_NOT_RUN,
    };
    if (!px || !opts || w <= 0 || h <= 0 || completion_timeout_ms <= 0) {
        return result;
    }

    ptouch_usb_target_t target;
    if (!ptouch_usb_target_snapshot(&target)) {
        result.transfer_rc = PTOUCH_USB_TRANSFER_NOT_ATTACHED;
        return result;
    }

