jh247247/esp32-brother-ptouch/src/ptouch_usb.c
    ptouch_print_opts_t effective = *opts;

    ptouch_print_job_t job;
    ptouch_print_job_init(&job);
    if (!ptouch_print_build_job_for_model(target.profile, px, w, h,
                                          &effective, &job)) {
        ptouch_print_job_free(&job);
        result.transfer_rc = PTOUCH_USB_TRANSFER_BUILD_FAILED;
        return result;
    }
    job.attachment_generation = target.generation;
    result = ptouch_usb_print_job_and_wait(
        &job, effective.timeout_ms, completion_timeout_ms);
    ptouch_print_job_free(&job);
    return result;
}

static const char *status_txn_locked(ptouch_status_t *st,
                                     bool after_inspection)
{
    SemaphoreHandle_t sem = NULL;
    usb_transfer_t *tx = NULL, *rx = NULL;
    bool tx_retained = false, rx_retained = false;
    ptouch_buf_t cmd; ptouch_buf_init(&cmd);
    const char *fail = NULL;
    int rxlen = 0;
    int frames_seen = 0;

    if (!st) return "missing status output";
    memset(st, 0, sizeof *st);
    if (transport_faulted()) {
        return "USB transport faulted; reboot required";
    }
    if (status_commands_blocked_locked() && !after_inspection) {
        return "status command blocked pending tape inspection";
    }
    if (s_dev_gone_pending || !s_intf_claimed || !s_dev) {
        fail = "no printer claimed (is it attached?)";
        goto done;
    }

    sem = xSemaphoreCreateBinary();
    ptouch_build_invalidate(&cmd);
    ptouch_build_init(&cmd);
    ptouch_build_status_request(&cmd);
    if (!sem || cmd.oom) { fail = "alloc failed"; goto done; }

    if (usb_host_transfer_alloc(cmd.len, 0, &tx) != ESP_OK) { fail = "OUT alloc failed"; goto done; }
    memcpy(tx->data_buffer, cmd.data, cmd.len);
    tx->num_bytes = (int)cmd.len;
    tx->bEndpointAddress = s_bulk_out_ep;
    if (submit_and_wait(tx, sem, 2000, NULL, false, &tx_retained) != XFER_OK) {
        fail = "OUT transfer failed";
        goto done;
    }

    rxlen = ((PTOUCH_STATUS_LENGTH + s_bulk_in_mps - 1) / s_bulk_in_mps) * s_bulk_in_mps;
    if (usb_host_transfer_alloc(rxlen, 0, &rx) != ESP_OK) { fail = "IN alloc failed"; goto done; }
    /* Automatic print notifications are FIFO-queued ahead of the reply to this
     * request. Drain both short packets and full stale notifications until the
     * current reply (or an error) arrives. */
    for (;;) {
        rx->num_bytes = rxlen;
        rx->bEndpointAddress = s_bulk_in_ep;
        if (submit_and_wait(rx, sem, 3000, NULL, false, &rx_retained) != XFER_OK) {
            fail = "IN transfer failed (no reply)";
            goto done;
        }
        if (rx->actual_num_bytes < PTOUCH_STATUS_LENGTH) {
            if (++frames_seen >= 16) { fail = "status reply not received"; goto done; }
            continue;
        }
        for (int off = 0;
             off + PTOUCH_STATUS_LENGTH <= rx->actual_num_bytes;
             off += PTOUCH_STATUS_LENGTH) {
            ptouch_status_t candidate;
            ptouch_parse_status(rx->data_buffer + off, &candidate);
            frames_seen++;
            if (!candidate.valid) continue;
            if (candidate.status_type == PTOUCH_ST_REPLY_TO_REQUEST ||
                ptouch_status_reports_error(&candidate)) {
                if (s_profile && s_profile->expected_status_model &&
                    candidate.model != s_profile->expected_status_model) {
                    fail = "status model does not match USB profile";
                    goto done;
                }
                *st = candidate;
                goto done;
            }
            ESP_LOGD(TAG, "drained stale status type=0x%02x before idle reply",
                     candidate.status_type);
        }
        if (frames_seen >= 16) { fail = "status reply not received"; goto done; }
    }

done:
    if (tx && !tx_retained) usb_host_transfer_free(tx);
    if (rx && !rx_retained) usb_host_transfer_free(rx);
    if (sem && !tx_retained && !rx_retained) vSemaphoreDelete(sem);
    ptouch_buf_free(&cmd);
    return fail;
}

bool ptouch_usb_ready_snapshot(ptouch_usb_ready_t *out)
{
    if (!out || !s_io_mtx) return false;
    memset(out, 0, sizeof *out);
    xSemaphoreTake(s_io_mtx, portMAX_DELAY);
    uint32_t generation = s_attachment_generation;
    const ptouch_model_profile_t *profile = s_profile;
    bool ready = !s_dev_gone_pending && s_intf_claimed && s_dev &&
                 profile_output_allowed(profile);
    ptouch_status_t status;
    memset(&status, 0, sizeof status);
    if (ready) {
        ready = status_txn_locked(&status, false) == NULL &&
                !s_dev_gone_pending && s_intf_claimed && s_dev &&
                s_attachment_generation == generation &&
                s_profile == profile &&
                ptouch_status_is_idle_ready(&status) &&
                ptouch_model_accepts_media(profile, status.media_width_mm,
                                           status.media_type) &&
                ptouch_media_geometry(profile, status.media_width_mm,
                                      &out->geometry);
    }
    if (ready) {
        out->target.profile = profile;
        out->target.vid = s_device_info.vid;
        out->target.pid = s_device_info.pid;
        out->target.generation = generation;
        out->status = status;
        publish_status_cache_locked(&status, generation);
    }
    xSemaphoreGive(s_io_mtx);
    return ready;
}

bool ptouch_usb_cached_ready_snapshot(ptouch_usb_ready_t *out)
{
    if (!out || !s_io_mtx || !s_cache_mtx) return false;
    memset(out, 0, sizeof *out);

    xSemaphoreTake(s_io_mtx, portMAX_DELAY);
    uint32_t generation = s_attachment_generation;
    const ptouch_model_profile_t *profile = s_profile;
    bool ready = !ptouch_usb_status_commands_blocked() &&
                 !s_dev_gone_pending && s_intf_claimed && s_dev &&
                 profile_output_allowed(profile);
    ptouch_status_t status;
    memset(&status, 0, sizeof status);
    if (ready) {
        int64_t ttl_us =
            (int64_t)(s_cfg.status_cache_ms > 0 ? s_cfg.status_cache_ms : 15000) *
            1000;
        xSemaphoreTake(s_cache_mtx, portMAX_DELAY);
        if (s_status_cache_us < 0 ||
            s_status_cache_generation != generation ||
            esp_timer_get_time() - s_status_cache_us >= ttl_us) {
            ready = false;
        } else {
            status = s_status_cache;
        }
        xSemaphoreGive(s_cache_mtx);
    }
    if (ready) {
        ready = status.valid && ptouch_status_is_idle_ready(&status) &&
                ptouch_model_accepts_media(profile, status.media_width_mm,
                                           status.media_type) &&
                ptouch_media_geometry(profile, status.media_width_mm,
                                      &out->geometry);
    }
    if (ready) {
        out->target.profile = profile;
        out->target.vid = s_device_info.vid;
        out->target.pid = s_device_info.pid;
        out->target.generation = generation;
        out->status = status;
    }
    xSemaphoreGive(s_io_mtx);
    return ready;
}

const char *ptouch_usb_status_txn(ptouch_status_t *st)
{
    if (!st) return "missing status output";
    memset(st, 0, sizeof *st);
    if (!s_io_mtx) return "USB not initialised";

