jh247247/esp32-brother-ptouch/src/ptouch_usb.c
    xSemaphoreTake(s_io_mtx, portMAX_DELAY);
    const char *fail = status_txn_locked(st, false);
    xSemaphoreGive(s_io_mtx);
    return fail;
}

const char *ptouch_usb_status_txn_after_inspection(ptouch_status_t *st)
{
    if (!st) return "missing status output";
    memset(st, 0, sizeof *st);
    if (!s_io_mtx) return "USB not initialised";

    xSemaphoreTake(s_io_mtx, portMAX_DELAY);
    const char *fail = status_txn_locked(st, true);
    xSemaphoreGive(s_io_mtx);
    return fail;
}

/* Keep short-lived observability stable across transient idle transaction
 * failures. Print completion itself owns s_io_mtx, so this function cannot
 * issue a forbidden command during Brother's mechanical printing window. A
 * real unplug drops s_intf_claimed and bypasses the cache immediately. */
bool ptouch_usb_status(ptouch_status_t *st)
{
    if (!st) return false;
    memset(st, 0, sizeof *st);
    bool fresh = false;
    if (s_io_mtx && xSemaphoreTake(s_io_mtx, 0) == pdTRUE) {
        uint32_t generation = s_attachment_generation;
        fresh = !s_dev_gone_pending && status_txn_locked(st, false) == NULL &&
                !s_dev_gone_pending &&
                generation == s_attachment_generation;
        if (fresh) publish_status_cache_locked(st, generation);
        xSemaphoreGive(s_io_mtx);
    }
    if (fresh) return true;
    if (ptouch_usb_status_commands_blocked()) return false;
    bool served = false;
    if (!s_dev_gone_pending && s_intf_claimed && s_dev && s_cache_mtx) {
        int64_t ttl_us = (int64_t)(s_cfg.status_cache_ms > 0 ? s_cfg.status_cache_ms : 15000) * 1000;
        xSemaphoreTake(s_cache_mtx, portMAX_DELAY);
        if (s_status_cache_us >= 0 &&
            s_status_cache_generation == s_attachment_generation &&
            esp_timer_get_time() - s_status_cache_us < ttl_us) {
            *st = s_status_cache;
            served = true;
        }
        xSemaphoreGive(s_cache_mtx);
    }
    return served;
}

/* -------------------------------------------------------- host tasks ------ */
static void client_cb(const usb_host_client_event_msg_t *msg, void *arg)
{
    switch (msg->event) {
    case USB_HOST_CLIENT_EVENT_NEW_DEV:
        ESP_LOGI(TAG, "USB device connected (addr %d)", msg->new_dev.address);
        /* Enumeration eventually claims the interface and therefore shares
         * the same lease as I/O. Defer it out of this callback so transfer
         * callbacks cannot be starved while another task owns that lease. */
        if (s_new_dev_addr_pending < 0) {
            s_new_dev_addr_pending = msg->new_dev.address;
        } else {
            ESP_LOGW(TAG, "preserving earlier pending USB device address");
        }
        break;
    case USB_HOST_CLIENT_EVENT_DEV_GONE:
        if (msg->dev_gone.dev_hdl != s_observed_dev) {
            ESP_LOGW(TAG, "ignoring removal of a non-target USB device");
            break;
        }
        ESP_LOGW(TAG, "USB target disconnected");
        /* This callback runs inside usb_host_client_handle_events(), which also
         * delivers transfer callbacks. Never block here on the I/O mutex: an
         * in-flight waiter may need this same client task to receive its
         * NO_DEVICE callback before it can release that mutex. Mark detached
         * immediately, then let usb_task clean up once the lease is available. */
        /* Do not mutate the profile/claim while an I/O owner may still use it.
         * The gone flag makes new snapshots fail immediately; usb_task clears
         * the full context after acquiring the transaction lease. */
        s_dev_gone_pending = true;
        break;
    default:
        break;
    }
}

static void host_lib_task(void *arg)
{
    for (;;) {
        uint32_t flags;
        usb_host_lib_handle_events(portMAX_DELAY, &flags);
        if (flags & USB_HOST_LIB_EVENT_FLAGS_NO_CLIENTS) usb_host_device_free_all();
    }
}

static void usb_task(void *arg)
{
    if (s_cfg.boot_delay_ms > 0) vTaskDelay(pdMS_TO_TICKS(s_cfg.boot_delay_ms));

    ESP_LOGW(TAG, "installing USB host library (USB-Serial-JTAG console goes away now)");
    usb_host_config_t hc = { 0 };
    hc.skip_phy_setup = false;
    hc.intr_flags = ESP_INTR_FLAG_LEVEL1;
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
    hc.peripheral_map = BIT0;   /* the S2/S3's single OTG peripheral (field is IDF >= 6) */
#endif
    esp_err_t err = usb_host_install(&hc);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "usb_host_install failed: %s", esp_err_to_name(err));
        emit(PTOUCH_USB_EVT_HOST_FAILED, NULL);
        vTaskDelete(NULL);
        return;
    }
    TaskHandle_t host_lib_handle = NULL;
    if (xTaskCreate(host_lib_task, "ptouch_usblib", 4096, NULL, 2,
                    &host_lib_handle) != pdPASS) {
        ESP_LOGE(TAG, "USB host-library task allocation failed");
        usb_host_uninstall();
        emit(PTOUCH_USB_EVT_HOST_FAILED, NULL);
        vTaskDelete(NULL);
        return;
    }

    usb_host_client_config_t cc = {
        .is_synchronous = false,
        .max_num_event_msg = 5,
        .async = { .client_event_callback = client_cb, .callback_arg = NULL },
    };
    err = usb_host_client_register(&cc, &s_client);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "usb_host_client_register failed: %s", esp_err_to_name(err));
        vTaskDelete(host_lib_handle);
        usb_host_uninstall();
        emit(PTOUCH_USB_EVT_HOST_FAILED, NULL);
        vTaskDelete(NULL);
        return;
    }
    /* HOST_UP is the allocation barrier consumed by the application: the
     * library task and client registration both exist before callbacks run. */
    emit(PTOUCH_USB_EVT_HOST_UP, NULL);
    for (;;) {
        TickType_t wait = (s_dev_gone_pending || s_new_dev_addr_pending >= 0)
                              ? pdMS_TO_TICKS(50)
                              : portMAX_DELAY;
        usb_host_client_handle_events(s_client, wait);

        if (s_dev_gone_pending && s_io_mtx &&
            xSemaphoreTake(s_io_mtx, 0) == pdTRUE) {
            if (s_observed_dev) {
                if (s_intf_claimed && s_dev) {
                    usb_host_interface_release(s_client, s_dev, s_intf_num);
                }
                usb_host_device_close(s_client, s_observed_dev);
            }
            s_dev = NULL;
            s_observed_dev = NULL;
            s_intf_claimed = false;
            s_device_detected = false;
            s_device_info.claimed = false;
            s_profile = NULL;
            ++s_attachment_generation;
            if (s_cache_mtx) {
                xSemaphoreTake(s_cache_mtx, portMAX_DELAY);
                s_status_cache_us = -1;
                s_status_cache_generation = 0;
                xSemaphoreGive(s_cache_mtx);
            }
            s_dev_gone_pending = false;
            emit(PTOUCH_USB_EVT_DETACHED, NULL);
            xSemaphoreGive(s_io_mtx);
        }

