jh247247/esp32-brother-ptouch/src/ptouch_usb.c
        if (!s_dev_gone_pending && s_new_dev_addr_pending >= 0 && s_io_mtx &&
            xSemaphoreTake(s_io_mtx, 0) == pdTRUE) {
            int addr = s_new_dev_addr_pending;
            s_new_dev_addr_pending = -1;
            report_device_locked((uint8_t)addr);
            xSemaphoreGive(s_io_mtx);
        }
    }
}

esp_err_t ptouch_usb_start(const ptouch_usb_config_t *cfg)
{
    taskENTER_CRITICAL(&s_start_lock);
    if (s_start_called) {
        taskEXIT_CRITICAL(&s_start_lock);
        return ESP_ERR_INVALID_STATE;
    }
    s_start_called = true;
    taskEXIT_CRITICAL(&s_start_lock);

    s_cfg = cfg ? *cfg : PTOUCH_USB_CONFIG_DEFAULT();
    s_io_mtx = xSemaphoreCreateMutex();
    s_cache_mtx = xSemaphoreCreateMutex();
    s_event_queue = xQueueCreate(8, sizeof(ptouch_usb_event_message_t));
    if (!s_io_mtx || !s_cache_mtx || !s_event_queue) goto no_mem;
    if (xTaskCreate(event_task, "ptouch_event", 3072, NULL, 2,
                    &s_event_task_handle) != pdPASS) {
        goto no_mem;
    }
    if (xTaskCreate(usb_task, "ptouch_usb", 5120, NULL, 3, NULL) != pdPASS) {
        vTaskDelete(s_event_task_handle);
        s_event_task_handle = NULL;
        goto no_mem;
    }
    return ESP_OK;

no_mem:
    if (s_event_queue) {
        vQueueDelete(s_event_queue);
        s_event_queue = NULL;
    }
    if (s_cache_mtx) {
        vSemaphoreDelete(s_cache_mtx);
        s_cache_mtx = NULL;
    }
    if (s_io_mtx) {
        vSemaphoreDelete(s_io_mtx);
        s_io_mtx = NULL;
    }
    taskENTER_CRITICAL(&s_start_lock);
    s_start_called = false;
    taskEXIT_CRITICAL(&s_start_lock);
    return ESP_ERR_NO_MEM;
}
